[
   {
      "body":"A blackjack dealer and a player with a thirteen count in his hand\nwere arguing about whether or not it was appropriate to tip the\ndealer.\n\nThe player said, \"When I get bad cards, it's not the dealer's fault.\nAccordingly, when I get good cards, the dealer obviously had nothing\nto do with it so, why should I tip him?\"\n\nThe dealer said, \"When you eat out do you tip the waiter?\"\n\n\"Yes.\"\n\n\"Well then, he serves you food, I'm serving you cards, so you should\ntip me.\"\n\n\"Okay, but, the waiter gives me what I ask for. I'll take an eight.\"",
      "category":"Children",
      "id":1,
      "rating":2.63
   },
   {
      "body":"At a dinner party, several of the guests were arguing whether men or women were more trustworthy. 'No woman,' said one man, scornfully, 'can keep a secret.' 'I don't know about that,' answered a blonde woman guest. 'I have kept my age a secret since I was twenty-one.' 'You'll let it out some day,' the man insisted. 'I hardly think so!' responded the blonde lady. 'When a woman has kept a secret for twenty-seven years, she can keep it forever.'",
      "category":"Blonde Jokes",
      "id":2,
      "rating":2.57
   },
   {
      "body":"One day this cop pulls over a blonde for speeding. The cop gets out of his car and asks the blonde for her license.''You cops should get it together. One day you take away my license and the next day you ask me to show it.''",
      "category":"Blonde Jokes",
      "id":3,
      "rating":3.09
   },
   {
      "body":"Three women are about to be executed for crimes. One's a brunette, one's a redhead, and one's a blonde.Two guards brings the brunette forward, and the executioner asks if she has any last requests. She says no, and the executioner shouts, \"Ready . . . Aim . . .\"Suddenly the brunette yells, \"earthquake!!\" Everyone is startled and looks around. She manages to escape.The angry guards then bring the redhead forward, and the executioner asks if she has any last requests. She says no, and the executioner shouts, \"Ready . . . Aim . . .\"The redhead then screams, \"tornado!!\" Yet again, everyone is startled and looks around. She too escapes execution.By this point, the blonde had figured out what the others did. The guards bring her forward, and the executioner asks if she has any last requests. She also says no, and the executioner shouts, Ready . . . Aim . . .\"The blonde shouts, \"fire!!\"",
      "category":"Blonde Jokes",
      "id":4,
      "rating":4.1
   },
   {
      "body":"A girl came skipping home FROM school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5, 6,7, 8, 9, 10!\" \"Very good,\" said her mother. \"Is it because I'm blonde, Mommy?\" \"Yes, Honey, it's because you're blonde.\" The next day the girl came skipping home FROM school. \"Mommy, Mommy,\" She yelled, \"we were saying the alphabet today, and all the other kids could only say it to D, but I said it to G. See? A,b, c, d, e, f, g!\" \"Very good,\" said her mother. \"Is it because I'm blonde, Mommy?\" \"Yes, Honey, it's because you're blonde.\" The next day the girl came skipping home FROM school. \"Mommy, Mommy,\" she yelled, \"we were in gym class today, and when we showered, all the other girls had flat chests, but I have these!\" And she lifted her tank top to reveal a pair of 36Cs. \"Very good,\" said her embarrassed mother. \"Is it because I'm blonde, mommy?\" \"No, Honey, it's because you're 25.\"",
      "category":"Blonde Jokes",
      "id":5,
      "rating":4.3
   },
   {
      "body":"An airline captain was helping a new blonde flight attendant prepare for her first overnight trip. Upon their arrival, the captain showed the flight attendant the best place for airline personnel to eat, shop and stay overnight. The next morning as the pilot was preparing the crew for the day's route, he noticed the new stewardess was missing. He knew which room she was in at the hotel and called her up to ask what happened to her. She answered the phone, crying, and said, \"I can't get out of the room!\" \"You can't get out of your room?\" the captain asked. \"Why not?\" She replied, \"There are only three doors in here,\" she sobbed, \"one is the bathroom, one is the closet, and one has a sign on it that says 'Do Not Disturb'!\"",
      "category":"Military",
      "id":6,
      "rating":3.23
   },
   {
      "body":"A blonde and a brunette decided to rob a bank. They quickly devised a good plan and they put their plan to action. \nThe brunette drove up to the front of the bank that they had decided to rob. She turned to the blonde and asked her, \"Now, do you remember what the plan is?\" The blonde sighed and replied, \"Yeah, yeah, I remember...\" The brunette went over the plan once more and let the blonde out to do her stuff. \n\nBefore the blonde could shut the door, the brunette yelled out, \"Be sure to be in and out in no more than 5 minutes!\" The blonde ran inside and the brunette waited in the car... and waited... and waited... and waited... and waited. After waiting for so long in the car, the blonde bursts out of the bank's doors, the alarm blaring loud enough to wake everyone up. The blonde was lugging a bank safe behind her by a rope tied around it. A security guard ran out of the bank, his pants down around his ankles and attempting to reach his gun. The blonde breathed heavily as she tried to put the safe in the car but finally just gave up and dropped the safe behind. She ran into the passenger seat and pulled the door shut, the car already moving. The security guard yelled, \"Stop! Stop!\" while the pair drove off, leaving the safe with rope tied tightly around it behind. The brunette frantically asked the blonde, \"What the hell happened in there?!?\" The blonde was panting and turned to the brunette and choked out, \"What do you mean? I followed the plan exactly!\" \nThe brunette paused and yelled, \"YOU IDIOT! YOU WERE SUPPOSED TO TIE UP THE GUARD AND BLOW THE SAFE!\"",
      "category":"Blonde Jokes",
      "id":7,
      "rating":4.0
   },
   {
      "body":"A brunette, a redhead and a blonde walk into a bar. For the sake of brevity, each one orders her drink with an abbreviated code word. The brunette walks up to the bartender and says, \"Hey give me an ML.\" The bartender nods his head and hands her a Miller Lite. Following her, the redhead walks up to the bartender and says, \"I'd like a BL.\" Giving her a nod, the bartender pulls up a Bud Lite. Last, the blonde walks up to the bartender and says, \"Give me a Fifteen.\" \"A Fifteen?\" the bartender replies, \"What the hell is that?\" \"Oh, you know,\" the blonde says, \"A Seven and Seven.\"",
      "category":"Blonde Jokes",
      "id":8,
      "rating":2.33
   },
   {
      "body":"A blonde suspects her boyfriend of cheating on her. She goes out and buys a gun. She goes to his apartment unexpectedly and sure enough, she opens the door and finds him in the arms of a redhead. Well, now she's angry! She opens her purse to take out the gun but as she does so, she is overcome with grief.  She takes the gun and points to her head. The boyfriend yells, \"No, honey, don't do it!!\" \"Shut up,\" she says, \"You're next.\"",
      "category":"Blonde Jokes",
      "id":9,
      "rating":3.77
   },
   {
      "body":"One day a blonde comes out of the tanning salon. She wants to make some money so she goes to one of the rich neighborhoods. She rings the door bell and says, \"HI, is there anything I could do for your house or you???\" The man thinks and says, \"Sure, can paint my porch. You will find all the stuff in the garage.\" The girl says, \"O.K., How much will you pay me?\" The man says, \"How much does fifty bucks sound?\" The blonde quickly agrees and get straight to work. The wife who had heard the conversation inside says, \"50 bucks, I hope she knows the porch goes all around the house!\" 25 minutes later the girl knocks on the door and says, \"O.K. I am done. Can I have my money now?\" Surprised the man replies, \"O.K. Let me get the money\" He comes back and the girl says as she is leaving, \"By the way, it's a Ferrari, not a Porch!\"",
      "category":"Blonde Jokes",
      "id":10,
      "rating":3.64
   }
]